app/controllers/comments_controller.rb

  def index
    @ticket = Ticket.find(params[:ticket_id])
    @comments = @ticket.comments.order(:created_at)
---
SELECT "tickets".* FROM "tickets" WHERE "tickets"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."ticket_id" = $1 ORDER BY "comments"."created_at" ASC  [["ticket_id", 1]]