app/controllers/feedbacks_controller.rb

  def index
    @executive = Executive.find(params[:executive_id])
---
SELECT "executives".* FROM "executives" WHERE "executives"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def set_feedback
      @feedback = Feedback.find(params[:id])
---
SELECT "feedbacks".* FROM "feedbacks" WHERE "feedbacks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]