app/controllers/pages_controller.rb

SELECT "requesting_users".* FROM "requesting_users"
SELECT "executives".* FROM "executives"
SELECT "supervisors".* FROM "supervisors"
SELECT "administrators".* FROM "administrators"
---
  def home
    @requesting_users = RequestingUser.all
    @executives = Executive.all
    @supervisors = Supervisor.all
    @administrators = Administrator.all