app/controllers/requesting_users_controller.rb

SELECT "requesting_users".* FROM "requesting_users"
---
  def index
    @requesting_users = RequestingUser.all

SELECT "requesting_users".* FROM "requesting_users" WHERE "requesting_users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_requesting_user
      @requesting_user = RequestingUser.find(params[:id])