app/controllers/resolutions_controller.rb

  def index
    @resolutions = Resolution.all
---
SELECT "resolutions".* FROM "resolutions"