app/controllers/resolutions_controller.rb

  def index
    @ticket = Ticket.find(params[:ticket_id])
---
SELECT "tickets".* FROM "tickets" WHERE "tickets"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]

    def set_resolution
      @resolution = Resolution.find(params[:id])
---
SELECT "resolutions".* FROM "resolutions" WHERE "resolutions"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]