app/controllers/tickets_controller.rb

  def index
    if params[:requesting_user_id]
      @requesting_user = RequestingUser.find(params[:requesting_user_id])
      @tickets = @requesting_user.tickets
    else
      @executive = Executive.find(params[:executive_id])
---
SELECT "requesting_users".* FROM "requesting_users" WHERE "requesting_users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "executives".* FROM "executives" WHERE "executives"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def ticketHome
    @tickets = Ticket.all
---
SELECT "tickets".* FROM "tickets"

  def search
    @tickets = Ticket.where('title LIKE ?', "%#{params[:search]}%")
---
SELECT "tickets".* FROM "tickets" WHERE (title LIKE '%asd32%')

  def create
    @ticket = Ticket.new(ticket_params)

    respond_to do |format|
      if @ticket.save
---
INSERT INTO "tickets" ("title", "description", "state", "tags", "priority", "response", "attached_documents", "created_at", "updated_at", "executive_id", "requesting_user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"

  def update
    respond_to do |format|
      if @ticket.update(ticket_params)
---
UPDATE "tickets" SET "title" = $1, "updated_at" = $2 WHERE "tickets"."id" = $3  [["title", "asd32"], ["updated_at", "2023-06-02 17:06:39.854029"], ["id", 9]]

    def set_ticket
      @ticket = Ticket.find(params[:id])
---
SELECT "tickets".* FROM "tickets" WHERE "tickets"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]